<a href="https://colab.research.google.com/github/brayan-mesquita/pandas/blob/main/analise_naufragio_titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
from matplotlib import pyplot as plt

In [5]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [10]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [26]:
age = df['Age']
type(age)

pandas.core.series.Series

filtrando dados da coluna idade

In [ ]:
df[(df.Age > 28) & (df.Age < 30)].head(3)

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
53           54         1       2  ...  26.0000   NaN         S
57           58         0       3  ...   7.2292   NaN         C
66           67         1       2  ...  10.5000   F33         S

[3 rows x 12 columns]

Outra sintaxe para filtrar

In [ ]:
df[df['Age'] == 30 ].head(3)

     PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
79            80         1       3  ...  12.475   NaN         S
157          158         0       3  ...   8.050   NaN         S
178          179         0       2  ...  13.000   NaN         S

[3 rows x 12 columns]

In [ ]:
df.loc[1].head() #dados do primeiro index

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Name: 1, dtype: object

In [ ]:
df.loc[[1,2,3]] #dados dos 3 primeiros

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S

[3 rows x 12 columns]

É possível selecionar **vários índices e várias colunas de uma vez só**. Passamos uma lista com os índices e uma outra lista com as colunas.

In [ ]:
df.loc[[1,2,4], ['Name','Sex','Age']]

                                                Name     Sex   Age
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
4                           Allen, Mr. William Henry    male  35.0

O loc também é usado para fazer slice (fatiamento)

In [ ]:
df.loc[10:15]
#df.loc[10:30:2] para incrementar de dois em dois
#df.loc[10:] do intem 10 para frente

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
10           11         1       3  ...  16.7000    G6         S
11           12         1       1  ...  26.5500  C103         S
12           13         0       3  ...   8.0500   NaN         S
13           14         0       3  ...  31.2750   NaN         S
14           15         0       3  ...   7.8542   NaN         S
15           16         1       2  ...  16.0000   NaN         S

[6 rows x 12 columns]

Consultando dados com o **query**

**CONDIÇÕES**
 operadores lógicos AND(&) e OR( | ) e expressões lógicas (==, != , >, <, >= e <=)

In [ ]:
df.query('Age > 20').head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.query('Age > 20 & Sex=="male"').head(10)

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0             1         0       3  ...   7.2500   NaN         S
4             5         0       3  ...   8.0500   NaN         S
6             7         0       1  ...  51.8625   E46         S
13           14         0       3  ...  31.2750   NaN         S
20           21         0       2  ...  26.0000   NaN         S
21           22         1       2  ...  13.0000   D56         S
23           24         1       1  ...  35.5000    A6         S
30           31         0       1  ...  27.7208   NaN         C
33           34         0       2  ...  10.5000   NaN         S
34           35         0       1  ...  82.1708   NaN         C

[10 rows x 12 columns]

Com o operador lógico OU

In [ ]:
df.query('Age > 20 | Sex=="male"').head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Se usarmos o inplace=True o nosso DataFrame original será substituído pelo novo DataFrame com a condição que foi passada. Para retornar ao DataFrame original será preciso fazer a leitura do arquivo novamente

In [ ]:
df.query('Embarked in ["C","Q"]', inplace=True)
df.head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1             2         1       1  ...  71.2833   C85         C
5             6         0       3  ...   8.4583   NaN         Q
9            10         1       2  ...  30.0708   NaN         C
16           17         0       3  ...  29.1250   NaN         Q
19           20         1       3  ...   7.2250   NaN         C

[5 rows x 12 columns]

fonte: https://minerandodados.com.br/analise-de-dados-com-python-usando-pandas/